modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
        <register>
          <name>DEVR4</name>
          <description>I3C Target x (1&lt;=x&lt;=4) register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DA</name>
              <description>Dynamic Address Target x</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>IBIACK</name>
              <description>IBI Acknowledge from Target x</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRACK</name>
              <description>Controller-role Acknowledge from Target x</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IBIDEN</name>
              <description>IBI Additional Data Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspended Transfer</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable Register access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXRLR</name>
          <description>I3C Maximum Read Length register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MRL</name>
              <description>Maximum Read Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>IBIP</name>
              <description>IBI Payload size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_1_BYTE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_2_BYTES</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_3_BYTES</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_4_BYTES</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXWLR</name>
          <description>I3C Maximum Write Length register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MWL</name>
              <description>Maximum Write Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR0</name>
          <description>I3C Timing 0 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCLL_PP</name>
              <description>SCL Low duration during I3C Push-Pull phases</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCLH_I3C</name>
              <description>SCL High duration during I3C Open-drain and Push-Pull phases</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCLL_OD</name>
              <description>SCL Low duration during I3C Open-drain phases and I2C transfer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCLH_I2C</name>
              <description>SCL High duration during I2C transfer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR1</name>
          <description>I3C Timing 1 register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AVAL</name>
              <description>Timing for I3C Bus Idle or Available condition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ASNCR</name>
              <description>Activity State of the New Controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATE_0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_3</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREE</name>
              <description>Timing for I3C Bus Free condition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDA_HD</name>
              <description>SDA Hold Duration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIME_0_5</name>
                  <description>SDA hold time is 0.5 x ti3cclk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIME_1_5</name>
                  <description>SDA hold time is 1.5 x ti3cclk</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR2</name>
          <description>I3C Timing 2 register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STALLT</name>
              <description>Stall on T bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLD</name>
              <description>Stall on PAR bit of data bytes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLC</name>
              <description>Stall on PAR bit of CCC byte</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLA</name>
              <description>Stall on ACK bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Controller Stall duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <description>I3C Bus Characteristics register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BCR0</name>
              <description>Max Data Speed Limitation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DATA_SPEED_LIMITATION</name>
                  <description>No max data speed limitation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX_DATA_SPEED_LIMITATION</name>
                  <description>Max data speed limitation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCR1</name>
              <description>IBI Request capable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCR2</name>
              <description>IBI Payload additional Mandatory Data Byte</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADDITIONAL_DATA</name>
                  <description>No data byte follows the accepted IBI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDITIONAL_DATA</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCR3</name>
              <description>Offline capable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCR4</name>
              <description>Virtual target support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCR5</name>
              <description>Advanced capabilities</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCR</name>
              <description>Bus Characteristics</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>I3C Device Characteristics register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DCR</name>
              <description>Devices Characteristics</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GETCAPR</name>
          <description>I3C GET CAPabilities register</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAPPEND</name>
              <description>IBI Request with Mandatory Data Byte</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PENDING_READ_NOTIFICATION</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENDING_READ_NOTIFICATION</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCAPR</name>
          <description>I3C Controller CAPabilities register</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAPDHOFF</name>
              <description>Controller-role handoff needed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_DELAYED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAYED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPGRP</name>
              <description>Group Address handoff supported</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SUPPORTED</name>
                  <description>Group Address Handoff is not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Group Address Handoff is supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GETMXDSR</name>
          <description>I3C GET Max Data Speed register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HOFFAS</name>
              <description>Handoff Activity State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATE_0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_3</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMT</name>
              <description>Get Max Data Speed response in format 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORMAT_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORMAT_2_LSB</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORMAT_2_MID</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORMAT_2_MSB</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDTURN</name>
              <description>Max Read Turnaround Middle Byte</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TSCO</name>
              <description>Clock-to-data Turnaround time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LESS_12NS</name>
                  <description>clock-to-data turnaround time tSCO &lt;= 12ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GREATER_12NS</name>
                  <description>clock-to-data turnaround time tSCO &gt; 12ns</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDR</name>
          <description>I3C Extended Provisioned ID register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MIPIID</name>
              <description>MIPI Instance ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IDTSEL</name>
              <description>ID Type Selector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MIPIMID</name>
              <description>MIPI Manufacturer ID</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
