modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCMIPP</name>
      <description>DCMIPP</description>
      <baseAddress>0x50002000</baseAddress>
      <interrupt>
        <name>DCMIPP</name>
        <description>DCMIPP global interrupt</description>
        <value>95</value>
      </interrupt>
      <registers>
        <register>
          <name>IPGR1</name>
          <description>IP-Plug global register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEMORYPAGE</name>
              <description>MEMORYPAGE[2:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>QOS_MODE</name>
              <description>Quality Of Service</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR2</name>
          <description>IP-Plug global register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PSTART</name>
              <description>request to lock the IP-Plug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR3</name>
          <description>IP-Plug global register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IDLE</name>
              <description>request to lock the IP-Plug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPGR8</name>
          <description>IP-Plug global register 8</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DID</name>
              <description>DID[5:0]: division identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>REVID</name>
              <description>REVID[4:0]: revision identifier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ARCHIID</name>
              <description>ARCHIID[4:0]: architecture identifier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>IPID</name>
              <description>IPPID[7:0]: IP identifier</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R1</name>
          <description>IP-Plug client 1 register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRAFFIC</name>
              <description>TRAFFIC[2:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OTR</name>
              <description>OTR[1:0]: max outstanding transactions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R2</name>
          <description>IP-Plug client 1 register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WLRU</name>
              <description>WLRU[3:0]: ratio for WLRU[3:0] arbitration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1R3</name>
          <description>IP-Plug client 1 register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPREGSTART</name>
              <description>DPREGSTART[4:0]: start word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DPREGEND</name>
              <description>DPREGEND[4:0]: end word</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCR</name>
          <description>Parallel interface control register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ESS</name>
              <description>Embedded synchronization select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKPOL</name>
              <description>Pixel clock polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSPOL</name>
              <description>Horizontal synchronization polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical synchronization polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EDM</name>
              <description>EDM[2:0]: Extended data mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Parallel Interface enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORMAT</name>
              <description>FORMAT[7:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SWAPCYCLES</name>
              <description>swap data</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAPBITS</name>
              <description>swap lsb vs msb</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESCR</name>
          <description>Parallel interface embedded sync code register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSC</name>
              <description>Frame start delimiter code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LSC</name>
              <description>Line start delimiter code</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LEC</name>
              <description>Line end delimiter code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FEC</name>
              <description>Frame end delimiter code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESUR</name>
          <description>Parallel interface embedded sync unmask register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSU</name>
              <description>Frame start delimiter unmask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LSU</name>
              <description>Line start delimiter unmask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LEU</name>
              <description>Line end delimiter unmask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FEU</name>
              <description>Frame end delimiter unmask</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIER</name>
          <description>Parallel interface interrupt enable register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERRIE</name>
              <description>Synchronization error interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSR</name>
          <description>Parallel interface status register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERRF</name>
              <description>Synchronization error raw interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSYNC</name>
              <description>HSYNC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNC</name>
              <description>VSYNC</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRFCR</name>
          <description>Parallel interface interrupt clear register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CERRF</name>
              <description>Synchronization error interrupt status clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMCR</name>
          <description>Common configuration register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFC</name>
              <description>Clear frame counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFRCR</name>
          <description>Common frame counter register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRMCNT</name>
              <description>FRMCNT[31:0]: frame counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMIER</name>
          <description>Common interrupt enable register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATXERRIE</name>
              <description>AXI Transfer error interrupt enable for IP_Plug</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRERRIE</name>
              <description>limit interrupt enable for the Parallel Interface</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LINEIE</name>
              <description>multi-Line Capture complete interrupt enable for the Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0FRAMEIE</name>
              <description>Frame Capture complete interrupt enable for the Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0VSYNCIE</name>
              <description>Vertical sync interrupt enable for the Pipe0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LIMITIE</name>
              <description>limit interrupt enable for the Pipe0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0OVRIE</name>
              <description>Overrun interrupt enable for the Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSR1</name>
          <description>Common status register 1</description>
          <addressOffset>0x3f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRHSYNC</name>
              <description>state of the HSYNC pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRVSYNC</name>
              <description>state of the VSYNC pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0CPTACT</name>
              <description>active frame capture for the Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSR2</name>
          <description>Common status register 2</description>
          <addressOffset>0x3f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATXERRF</name>
              <description>AXI transfer error interrupt status flag for the IPPLUG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRERRF</name>
              <description>Synchronization error raw interrupt status flag for the Parallel Interface</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LINEF</name>
              <description>multi-Line Capture completed raw interrupt status flag for the Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0FRAMEF</name>
              <description>Frame Capture completed raw interrupt status flag for the Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0VSYNCF</name>
              <description>VSYNC raw interrupt status flag for the Pipe0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0LIMITF</name>
              <description>Limit raw interrupt status flag for the Pipe0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0OVRF</name>
              <description>Overrun raw interrupt status flag for the Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFCR</name>
          <description>Common interrupt clear register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CATXERRF</name>
              <description>AXI transfer error interrupt status clear for the IPPLUG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPRERRF</name>
              <description>Synchronization error raw interrupt status clear for the Parallel Interface</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0LINEF</name>
              <description>multi-Line Capture completed raw interrupt status clear for the Pipe0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0FRAMEF</name>
              <description>Frame Capture completed raw interrupt status clear for the Pipe0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0VSYNCF</name>
              <description>VSYNC raw interrupt status clear for the Pipe0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0LIMITF</name>
              <description>Limit raw interrupt status clear for the Pipe0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CP0OVRF</name>
              <description>Overrun raw interrupt status clear for the Pipe0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FSCR</name>
          <description>Pipe0 flow selection configuration register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PIPEN</name>
              <description>activation of this Pipe</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FCTCR</name>
          <description>Pipe0 flow control configuration register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>FRATE[1:0]: Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0SCSTR</name>
          <description>Pipe0 stat/crop start register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>HSTART[11:0]: horizontal start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>VSTART[11:0]: vertical start</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0SCSZR</name>
          <description>Pipe0 stat/crop size register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>HSTART[11:0]: horizontal size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>VSTART[11:0]: vertical size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>POSNEG</name>
              <description>Negative area</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DCCNTR</name>
          <description>Pipe0 dump counter register</description>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT[25:0]: number of data dumped during the frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0DCLMTR</name>
          <description>Pipe0 dump limit register</description>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>LIMIT[23:0]: maximum number of data dumped during the frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
