modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
        <register>
          <name>P0PPCR</name>
          <description>Pipe0 pixel packer configuration register</description>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSM</name>
              <description>Byte Select mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OEBS</name>
              <description>Odd/Even Byte Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSM</name>
              <description>Line Select mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OELS</name>
              <description>Odd/Even Line Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>LINEMULT[2:0]</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0PPM0AR1</name>
          <description>Pipe0 pixel packer memory0 address register 1</description>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MOA</name>
              <description>Memory 0 address register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0PPM0AR2</name>
          <description>Pipe0 pixel packer memory0 address register 2</description>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MOA</name>
              <description>Memory 0 address register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0IER</name>
          <description>Pipe0 interrupt enable register</description>
          <addressOffset>0x5f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEIE</name>
              <description>multi-Line Capture completed interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEIE</name>
              <description>Frame Capture completed interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCIE</name>
              <description>VSYNC interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIMITIE</name>
              <description>Limit interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRIE</name>
              <description>Overrun interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0SR</name>
          <description>Pipe0 status register</description>
          <addressOffset>0x5f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEF</name>
              <description>multi-Line Capture completed interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEF</name>
              <description>Frame Capture completed interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCF</name>
              <description>VSYNC interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LIMITF</name>
              <description>Limit interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRF</name>
              <description>Overrun interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSTLINE</name>
              <description>Last Line Lsb bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTACT</name>
              <description>Capture immediate status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0FCR</name>
          <description>Pipe0 interrupt clear register</description>
          <addressOffset>0x5fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLINEF</name>
              <description>multi-Line Capture completed interrupt status clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFRAMEF</name>
              <description>Frame Capture completed interrupt status clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CVSYNCF</name>
              <description>VSYNC interrupt status clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLIMITF</name>
              <description>Limit interrupt status clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CFCTCR</name>
          <description>Pipe0 current flow control configuration register</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>FRATE[1:0]: Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CSCSTR</name>
          <description>Pipe0 current stat/crop start register</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>HSTART[11:0]: horizontal start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>VSTART[11:0]: vertical start</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CSCSZR</name>
          <description>Pipe0 current stat/crop size register</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>HSTART[11:0]: horizontal size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>VSTART[11:0]: vertical size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>POSNEG</name>
              <description>Negative area</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CPPCR</name>
          <description>Pipe0 current pixel packer configuration register</description>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSM</name>
              <description>Byte Select mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OEBS</name>
              <description>Odd/Even Byte Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSM</name>
              <description>Line Select mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OELS</name>
              <description>Odd/Even Line Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>LINEMULT[2:0]</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CPPM0AR1</name>
          <description>Pipe0 current pixel packer memory0 address register 1</description>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MOA</name>
              <description>Memory 0 address register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P0CPPM0AR2</name>
          <description>Pipe0 current pixel packer memory0 address register 2</description>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MOA</name>
              <description>Memory 0 address register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
