modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
        <register>
          <name>CDCFGR</name>
          <description>RCC CPU domain configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPRE</name>
              <description>CPRE[3:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCFGR</name>
          <description>RCC Bus matrix configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BMPRE</name>
              <description>BMPRE[3:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCFGR</name>
          <description>RCC APB clock configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PPRE1</name>
              <description>PPRE1[2:0] bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PPRE2[2:0] bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE4</name>
              <description>PPRE4[2:0] bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE5</name>
              <description>PPRE5[2:0] bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCKSELR</name>
          <description>RCC PLLs clock source selection register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>DIVMx and PLLs clock source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVM1</name>
              <description>DIVM1[5:0] bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM2</name>
              <description>DIVM2[5:0] bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM3</name>
              <description>DIVM3[5:0] bits</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <description>RCC PLLs configuration register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLL1FRACEN</name>
              <description>PLL1 fractional latch enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1VCOSEL</name>
              <description>PLL1 VCO selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDE</name>
                  <description>VCO output range: 400 to 1600 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>VCO output range: 150 to 420 MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL1SSCGEN</name>
              <description>PLL1 Spread Spectrum Clock Generator enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RGE</name>
              <description>PLL1RGE[1:0] bits: PLL1 input frequency range</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLLINPUTRANGE_1_2</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLINPUTRANGE_2_4</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLINPUTRANGE_4_8</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLINPUTRANGE_8_16</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL1PEN</name>
              <description>PLL1 DIVP divider output enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1QEN</name>
              <description>PLL1 DIVQ divider output enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1REN</name>
              <description>PLL1 DIVR divider output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1SEN</name>
              <description>PLL1 DIVS divider output enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2FRACEN</name>
              <description>PLL2 fractional latch enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2VCOSEL</name>
              <description>PLL2 VCO selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2SSCGEN</name>
              <description>PLL2 Spread Spectrum Clock Generator enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RGE</name>
              <description>PLL2RGE[1:0] bits: PLL2 input frequency range</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL2PEN</name>
              <description>PLL2 DIVP divider output enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2QEN</name>
              <description>PLL2 DIVQ divider output enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2REN</name>
              <description>PLL2 DIVR divider output enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2SEN</name>
              <description>PLL2 DIVS divider output enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2TEN</name>
              <description>PLL2 DIVT divider output enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3FRACEN</name>
              <description>PLL3 fractional latch enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3VCOSEL</name>
              <description>PLL3 VCO selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3SSCGEN</name>
              <description>PLL3 Spread Spectrum Clock Generator enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RGE</name>
              <description>PLL3RGE[1:0] bits: PLL3 input frequency range</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL3PEN</name>
              <description>PLL3 DIVP divider output enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3QEN</name>
              <description>PLL3 DIVQ divider output enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3REN</name>
              <description>PLL3 DIVR divider output enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3SEN</name>
              <description>PLL3 DIVS divider output enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1DIVR1</name>
          <description>RCC PLL1 dividers configuration register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN1[8:0] bits: PLL1 DIVN division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <description>DIVP1[6:0] bits: PLL1 DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <description>DIVQ1[6:0] bits: PLL1 DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <description>DIVR1[6:0] bits: PLL1 DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1FRACR</name>
          <description>RCC PLL1 fractional divider configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN[12:0] bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR1</name>
          <description>RCC PLL2 dividers configuration register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN2[8:0] bits: PLL2 DIVN division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <description>DIVP2[6:0] bits: PLL2 DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <description>DIVQ2[6:0] bits: PLL2 DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <description>DIVR2[6:0] bits: PLL2 DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2FRACR</name>
          <description>RCC PLL2 fractional divider configuration register</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN[12:0] bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR1</name>
          <description>RCC PLL3 dividers configuration register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN3[8:0] bits: PLL3 DIVN division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <description>DIVP3[6:0] bits: PLL3 DIVP division factor</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <description>DIVQ3[6:0] bits: PLL3 DIVQ division factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <description>DIVR3[6:0] bits: PLL3 DIVR division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3FRACR</name>
          <description>RCC PLL3 fractional divider configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN[12:0] bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
