modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
        <register>
          <name>CCIPR1</name>
          <description>RCC AHB peripherals kernel clock configuration register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FMCSEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1Q</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2R</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC12SEL</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL2S</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2T</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI1SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>XSPI2SEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USBREFCKSEL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKSOURCE_16M</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE_19_2M</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE_20M</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE_24M</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE_26M</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE_32M</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPHYCSEL</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3Q</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTGFSSEL</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI48</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK48</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3Q</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1REFCKSEL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RMII</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FB</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1PHYCKSEL</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3S</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADF1SEL</name>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2P</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3P</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSEL</name>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL2P</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3R</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSSISEL</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL3R</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKPERSEL</name>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <description>RCC APB1 peripherals kernel clock configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UART234578SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI23SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C23SEL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C1_I3C1SEL</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3R</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FDCANSEL</name>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1Q</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2Q</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPDIFRXSEL</name>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL1Q</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2R</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3R</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CECSEL</name>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_DIV_122</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <description>RCC APB2 peripherals kernel clock configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USART1SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI45SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI1SEL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SAI1SEL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SAI2SEL</name>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR4</name>
          <description>RCC APB4/APB5 peripherals kernel clock configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPUART1SEL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK4</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2Q</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3Q</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSOURCE</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI6SEL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM23SEL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM45SEL</name>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <description>RCC clock interrupt enable register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYIE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDYIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDYIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDYIE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDYIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSIE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <description>RCC clock interrupt flag register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDYF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDYF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDYF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDYF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSF</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSECSSF</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <description>RCC clock interrupt clear register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYC</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYC</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDYC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYC</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDYC</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDYC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDYC</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSC</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSECSSC</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
