modm-ext/data.modm.io/docs/svd/header_stm32h7r7xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_2</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff43000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_3</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff44000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_4</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff45000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_5</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff46000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_6</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff47000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_7</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff48000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_8</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff49000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_9</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff4a000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_10</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff4b000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AXIM_ASIB_1">
      <name>AXIM_ASIB_11</name>
      <description>AXIM ASIB</description>
      <baseAddress>0xbff4c000</baseAddress>
    </peripheral>
  </peripherals>
</device>
